## Librerias

In [1]:
import pandas as pd
import sqlite3

## Conexión

In [8]:

connection = sqlite3.connect("data/sql-murder-mystery.db")


crsr = connection.cursor()

In [9]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):

   
    crsr.execute(query)

    
    ans = crsr.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

## Ayuda

## Consultas

In [10]:
pd.set_option('display.max_colwidth', None)

In [11]:
query1 = """
SELECT *
FROM crime_scene_report
WHERE type = 'murder' 
AND city = 'SQL City'
AND date = 20180115
"""

sql_query(query1)

OperationalError: no such table: crime_scene_report

In [7]:
query2 = """
SELECT name, address_number, address_street_name
FROM person
WHERE address_street_name LIKE '%Northwestern%'
ORDER BY address_number DESC
"""

sql_query(query2)

OperationalError: no such table: person

In [22]:
query3 = """
SELECT p.name, i.transcript
FROM interview i
INNER JOIN person p
ON i.person_id = p.id
WHERE p.name = 'Morty Schapiro'
"""

sql_query(query3)

,name,transcript
0,Morty Schapiro,"I heard a gunshot and then saw a man run out. He had a ""Get Fit Now Gym"" bag. The membership number on the bag started with ""48Z"". Only gold members have those bags. The man got into a car with a plate that included ""H42W""."

In [23]:
query4 = """
SELECT name, address_number, address_street_name
FROM person
WHERE address_street_name LIKE '%Franklin Ave%'
AND name LIKE '%Annabel%'
"""

sql_query(query4)

             name  address_number address_street_name
0  Annabel Miller             103        Franklin Ave

In [24]:
query1 = """
SELECT p.name, i.transcript
FROM interview i
INNER JOIN person p
ON i.person_id = p.id
WHERE p.name = 'Annabel Miller'
"""

sql_query(query1)

,name,transcript
0,Annabel Miller,"I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th."

In [12]:
query1 = """
SELECT m.name
FROM get_fit_now_member as m
INNER JOIN get_fit_now_check_in as c
ON m.id = c.membership_id
INNER JOIN person as p
ON m.person_id = p.id
INNER JOIN drivers_license as l
ON p.license_id = l.id
WHERE c.check_in_date = 20180109
AND l.plate_number LIKE '%H42W%'
AND m.membership_status = 'gold'
"""

sql_query(query1)

OperationalError: no such table: get_fit_now_member

In [29]:
query3 = """
INSERT INTO solution
VALUES
(1, 'Jeremy Bowers')                                                
"""

sql_query(query3)

TypeError: 'NoneType' object is not iterable

In [30]:
query3 = """
SELECT value
FROM solution
"""

sql_query(query3)

                                                                                                                                                                                                                                                                                                                                                                                                value
0  Congrats, you found the murderer! But wait, there's more... If you think you're up for a challenge, try querying the interview transcript of the murderer to find the real villain behind this crime. If you feel especially confident in your SQL skills, try to complete this final step with no more than 2 queries. Use this same INSERT statement with your new suspect to check your answer.

In [28]:
query3 = """
SELECT p.name, i.transcript
FROM interview i
INNER JOIN person p
ON i.person_id = p.id
WHERE p.name = 'Jeremy Bowers'
"""

sql_query(query3)

,name,transcript
0,Jeremy Bowers,"I was hired by a woman with a lot of money. I don't know her name but I know she's around 5'5"" (65"") or 5'7"" (67""). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017.\n"

In [49]:
query3 = """
SELECT p.name, dl.height, dl.car_make || ' ' || dl.car_model as coche, f.event_name as evento
FROM person AS p
INNER JOIN drivers_license AS dl
ON p.license_id = dl.id
INNER JOIN facebook_event_checkin AS f
ON f.person_id = p.id
WHERE dl.hair_color = 'red'
AND dl.gender = 'female'
AND dl.car_make = 'Tesla'
AND dl.car_model = 'Model S'
AND dl.height BETWEEN 65 AND 67
AND f.date LIKE '201712%'
AND f.event_name = 'SQL Symphony Concert'
GROUP BY p.name
HAVING COUNT(f.person_id)  = 3
"""

sql_query(query3)

               name  height          coche                evento
0  Miranda Priestly      66  Tesla Model S  SQL Symphony Concert

In [43]:
query3 = """
INSERT INTO solution
VALUES
(1, 'Miranda Priestly')                                                
"""

sql_query(query3)

TypeError: 'NoneType' object is not iterable

In [44]:
query3 = """
SELECT value
FROM solution
"""

sql_query(query3)

                                                                                                                                                          value
0  Congrats, you found the brains behind the murder! Everyone in SQL City hails you as the greatest SQL detective of all time. Time to break out the champagne!

In [48]:
query3 = """
SELECT *
FROM income
ORDER BY annual_income DESC
"""

sql_query(query3).head(20)

          ssn  annual_income
0   361660921         498500
1   121635236         489800
2   118015315         486600
3   541217354         476300
4   313890530         475700
5   311494850         473100
6   800582909         449400
7   990250718         448000
8   208676025         446200
9   625660122         446000
10  250672272         442300
11  442830147         440900
12  828936905         439500
13  149045552         431400
14  276609539         427200
15  583476083         426200
16  271242578         422200
17  653649119         410200
18  251610858         408900
19  130276880         407100